In [2]:
import pandas as pd
import numpy as np

C:\Users\Ryzen\AppData\Local\Temp\ipykernel_4624\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
df=pd.read_csv(r"E:\New folder\gap.csv")

In [4]:
df.rename(columns={'country':'COUNTRY','gdpPercap':'GDP'})

,COUNTRY,continent,year,lifeExp,pop,GDP,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.351,9216418,706.157306,ZWE,716
1700,Zimbabwe,Africa,1992,60.377,10704340,693.420786,ZWE,716
1701,Zimbabwe,Africa,1997,46.809,11404948,792.449960,ZWE,716
1702,Zimbabwe,Africa,2002,39.989,11926563,672.038623,ZWE,716
1703,Zimbabwe,Africa,2007,43.487,12311143,469.709298,ZWE,716

In [5]:
df

,country,continent,year,lifeExp,pop,gdpPercap,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.351,9216418,706.157306,ZWE,716
1700,Zimbabwe,Africa,1992,60.377,10704340,693.420786,ZWE,716
1701,Zimbabwe,Africa,1997,46.809,11404948,792.449960,ZWE,716
1702,Zimbabwe,Africa,2002,39.989,11926563,672.038623,ZWE,716
1703,Zimbabwe,Africa,2007,43.487,12311143,469.709298,ZWE,716

In [6]:
df.rename(columns={'country':'COUNTRY','gdpPercap':'GDP'},inplace=True)

In [7]:
df

,COUNTRY,continent,year,lifeExp,pop,GDP,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.351,9216418,706.157306,ZWE,716
1700,Zimbabwe,Africa,1992,60.377,10704340,693.420786,ZWE,716
1701,Zimbabwe,Africa,1997,46.809,11404948,792.449960,ZWE,716
1702,Zimbabwe,Africa,2002,39.989,11926563,672.038623,ZWE,716
1703,Zimbabwe,Africa,2007,43.487,12311143,469.709298,ZWE,716

In [8]:
df.rename(columns={'country':'COUNTRY','gdpPercap':'GDP'},inplace=False)

,COUNTRY,continent,year,lifeExp,pop,GDP,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.351,9216418,706.157306,ZWE,716
1700,Zimbabwe,Africa,1992,60.377,10704340,693.420786,ZWE,716
1701,Zimbabwe,Africa,1997,46.809,11404948,792.449960,ZWE,716
1702,Zimbabwe,Africa,2002,39.989,11926563,672.038623,ZWE,716
1703,Zimbabwe,Africa,2007,43.487,12311143,469.709298,ZWE,716

## Fetch the value based on the index position or index coulmns

# Lookup func,hlookup v look

# set index()

In [9]:
temp=df.set_index('year')

In [10]:
temp

          COUNTRY continent  lifeExp       pop         GDP iso_alpha  iso_num
year
1952  Afghanistan      Asia   28.801   8425333  779.445314       AFG        4
1957  Afghanistan      Asia   30.332   9240934  820.853030       AFG        4
1962  Afghanistan      Asia   31.997  10267083  853.100710       AFG        4
1967  Afghanistan      Asia   34.020  11537966  836.197138       AFG        4
1972  Afghanistan      Asia   36.088  13079460  739.981106       AFG        4
...           ...       ...      ...       ...         ...       ...      ...
1987     Zimbabwe    Africa   62.351   9216418  706.157306       ZWE      716
1992     Zimbabwe    Africa   60.377  10704340  693.420786       ZWE      716
1997     Zimbabwe    Africa   46.809  11404948  792.449960       ZWE      716
2002     Zimbabwe    Africa   39.989  11926563  672.038623       ZWE      716
2007     Zimbabwe    Africa   43.487  12311143  469.709298       ZWE      716

[1704 rows x 7 columns]

In [11]:
temp.iloc[1689]

COUNTRY           Zambia
continent         Africa
lifeExp           40.238
pop              9417789
GDP          1071.353818
iso_alpha            ZMB
iso_num              894
Name: 1997, dtype: object

In [12]:
temp.loc[[2007]]

,COUNTRY,continent,lifeExp,pop,GDP,iso_alpha,iso_num
year,,,,,,,
2007,Afghanistan,Asia,43.828,31889923,974.580338,AFG,4
2007,Albania,Europe,76.423,3600523,5937.029526,ALB,8
2007,Algeria,Africa,72.301,33333216,6223.367465,DZA,12
2007,Angola,Africa,42.731,12420476,4797.231267,AGO,24
2007,Argentina,Americas,75.320,40301927,12779.379640,ARG,32
...,...,...,...,...,...,...,...
2007,Vietnam,Asia,74.249,85262356,2441.576404,VNM,704
2007,West Bank and Gaza,Asia,73.422,4018332,3025.349798,PSE,275
2007,"Yemen, Rep.",Asia,62.698,22211743,2280.769906,YEM,887
2007,Zambia,Africa,42.384,11746035,1271.211593,ZMB,894
2007,Zimbabwe,Africa,43.487,12311143,469.709298,ZWE,716

In [13]:
temp.iloc[50:100:1]

         COUNTRY continent  lifeExp       pop           GDP iso_alpha  iso_num
year
1962   Argentina  Americas   65.142  21283783   7133.166023       ARG       32
1967   Argentina  Americas   65.634  22934225   8052.953021       ARG       32
1972   Argentina  Americas   67.065  24779799   9443.038526       ARG       32
1977   Argentina  Americas   68.481  26983828  10079.026740       ARG       32
1982   Argentina  Americas   69.942  29341374   8997.897412       ARG       32
1987   Argentina  Americas   70.774  31620918   9139.671389       ARG       32
1992   Argentina  Americas   71.868  33958947   9308.418710       ARG       32
1997   Argentina  Americas   73.275  36203463  10967.281950       ARG       32
2002   Argentina  Americas   74.340  38331121   8797.640716       ARG       32
2007   Argentina  Americas   75.320  40301927  12779.379640       ARG       32
1952   Australia   Oceania   69.120   8691212  10039.595640       AUS       36
1957   Australia   Oceania   70.330   9712569  10949.649590       AUS       36
1962   Australia   Oceania   70.930  10794968  12217.226860       AUS       36
1967   Australia   Oceania   71.100  11872264  14526.124650       AUS       36
1972   Australia   Oceania   71.930  13177000  16788.629480       AUS       36
1977   Australia   Oceania   73.490  14074100  18334.197510       AUS       36
1982   Australia   Oceania   74.740  15184200  19477.009280       AUS       36
1987   Australia   Oceania   76.320  16257249  21888.889030       AUS       36
1992   Australia   Oceania   77.560  17481977  23424.766830       AUS       36
1997   Australia   Oceania   78.830  18565243  26997.936570       AUS       36
2002   Australia   Oceania   80.370  19546792  30687.754730       AUS       36
2007   Australia   Oceania   81.235  20434176  34435.367440       AUS       36
1952     Austria    Europe   66.800   6927772   6137.076492       AUT       40
1957     Austria    Europe   67.480   6965860   8842.598030       AUT       40
1962     Austria    Europe   69.540   7129864  10750.721110       AUT       40
1967     Austria    Europe   70.140   7376998  12834.602400       AUT       40
1972     Austria    Europe   70.630   7544201  16661.625600       AUT       40
1977     Austria    Europe   72.170   7568430  19749.422300       AUT       40
1982     Austria    Europe   73.180   7574613  21597.083620       AUT       40
1987     Austria    Europe   74.940   7578903  23687.826070       AUT       40
1992     Austria    Europe   76.040   7914969  27042.018680       AUT       40
1997     Austria    Europe   77.510   8069876  29095.920660       AUT       40
2002     Austria    Europe   78.980   8148312  32417.607690       AUT       40
2007     Austria    Europe   79.829   8199783  36126.492700       AUT       40
1952     Bahrain      Asia   50.939    120447   9867.084765       BHR       48
1957     Bahrain      Asia   53.832    138655  11635.799450       BHR       48
1962     Bahrain      Asia   56.923    171863  12753.275140       BHR       48
1967     Bahrain      Asia   59.923    202182  14804.672700       BHR       48
1972     Bahrain      Asia   63.300    230800  18268.658390       BHR       48
1977     Bahrain      Asia   65.593    297410  19340.101960       BHR       48
1982     Bahrain      Asia   69.052    377967  19211.147310       BHR       48
1987     Bahrain      Asia   70.750    454612  18524.024060       BHR       48
1992     Bahrain      Asia   72.601    529491  19035.579170       BHR       48
1997     Bahrain      Asia   73.925    598561  20292.016790       BHR       48
2002     Bahrain      Asia   74.795    656397  23403.559270       BHR       48
2007     Bahrain      Asia   75.635    708573  29796.048340       BHR       48
1952  Bangladesh      Asia   37.484  46886859    684.244172       BGD       50
1957  Bangladesh      Asia   39.348  51365468    661.637458       BGD       50
1962  Bangladesh      Asia   41.216  56839289    686.341554       BGD       50
1967  Bangladesh      Asia   43.453  62821884    721.186086       BGD       50

# df.iloc[row_slicing,columns_slicing]
# row_slicing:starting index: ending:step

In [14]:
temp

          COUNTRY continent  lifeExp       pop         GDP iso_alpha  iso_num
year
1952  Afghanistan      Asia   28.801   8425333  779.445314       AFG        4
1957  Afghanistan      Asia   30.332   9240934  820.853030       AFG        4
1962  Afghanistan      Asia   31.997  10267083  853.100710       AFG        4
1967  Afghanistan      Asia   34.020  11537966  836.197138       AFG        4
1972  Afghanistan      Asia   36.088  13079460  739.981106       AFG        4
...           ...       ...      ...       ...         ...       ...      ...
1987     Zimbabwe    Africa   62.351   9216418  706.157306       ZWE      716
1992     Zimbabwe    Africa   60.377  10704340  693.420786       ZWE      716
1997     Zimbabwe    Africa   46.809  11404948  792.449960       ZWE      716
2002     Zimbabwe    Africa   39.989  11926563  672.038623       ZWE      716
2007     Zimbabwe    Africa   43.487  12311143  469.709298       ZWE      716

[1704 rows x 7 columns]

In [15]:
df.iloc[50:100:2,:3]

       COUNTRY continent  year
50   Argentina  Americas  1962
52   Argentina  Americas  1972
54   Argentina  Americas  1982
56   Argentina  Americas  1992
58   Argentina  Americas  2002
60   Australia   Oceania  1952
62   Australia   Oceania  1962
64   Australia   Oceania  1972
66   Australia   Oceania  1982
68   Australia   Oceania  1992
70   Australia   Oceania  2002
72     Austria    Europe  1952
74     Austria    Europe  1962
76     Austria    Europe  1972
78     Austria    Europe  1982
80     Austria    Europe  1992
82     Austria    Europe  2002
84     Bahrain      Asia  1952
86     Bahrain      Asia  1962
88     Bahrain      Asia  1972
90     Bahrain      Asia  1982
92     Bahrain      Asia  1992
94     Bahrain      Asia  2002
96  Bangladesh      Asia  1952
98  Bangladesh      Asia  1962

# loc

In [16]:
temp.reset_index()

,year,COUNTRY,continent,lifeExp,pop,GDP,iso_alpha,iso_num
0,1952,Afghanistan,Asia,28.801,8425333,779.445314,AFG,4
1,1957,Afghanistan,Asia,30.332,9240934,820.853030,AFG,4
2,1962,Afghanistan,Asia,31.997,10267083,853.100710,AFG,4
3,1967,Afghanistan,Asia,34.020,11537966,836.197138,AFG,4
4,1972,Afghanistan,Asia,36.088,13079460,739.981106,AFG,4
...,...,...,...,...,...,...,...,...
1699,1987,Zimbabwe,Africa,62.351,9216418,706.157306,ZWE,716
1700,1992,Zimbabwe,Africa,60.377,10704340,693.420786,ZWE,716
1701,1997,Zimbabwe,Africa,46.809,11404948,792.449960,ZWE,716
1702,2002,Zimbabwe,Africa,39.989,11926563,672.038623,ZWE,716
1703,2007,Zimbabwe,Africa,43.487,12311143,469.709298,ZWE,716

In [17]:
temp=temp.set_index('continent')

In [18]:
temp.loc[['Asia','Africa'],['COUNTRY','pop']]

               COUNTRY       pop
continent
Asia       Afghanistan   8425333
Asia       Afghanistan   9240934
Asia       Afghanistan  10267083
Asia       Afghanistan  11537966
Asia       Afghanistan  13079460
...                ...       ...
Africa        Zimbabwe   9216418
Africa        Zimbabwe  10704340
Africa        Zimbabwe  11404948
Africa        Zimbabwe  11926563
Africa        Zimbabwe  12311143

[1020 rows x 2 columns]

In [19]:
temp.iloc[0:100:5,:3]

               COUNTRY  lifeExp       pop
continent
Asia       Afghanistan   28.801   8425333
Asia       Afghanistan   38.438  14880372
Asia       Afghanistan   42.129  25268405
Europe         Albania   66.220   1984060
Europe         Albania   71.581   3326498
Africa         Algeria   45.685  10270856
Africa         Algeria   61.368  20033753
Africa         Algeria   72.301  33333216
Africa          Angola   37.928   5894858
Africa          Angola   40.963   9875024
Americas     Argentina   65.142  21283783
Americas     Argentina   70.774  31620918
Oceania      Australia   69.120   8691212
Oceania      Australia   73.490  14074100
Oceania      Australia   80.370  19546792
Europe         Austria   70.140   7376998
Europe         Austria   76.040   7914969
Asia           Bahrain   53.832    138655
Asia           Bahrain   69.052    377967
Asia           Bahrain   75.635    708573

# nlargest, n smallest

In [20]:
df

,COUNTRY,continent,year,lifeExp,pop,GDP,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.351,9216418,706.157306,ZWE,716
1700,Zimbabwe,Africa,1992,60.377,10704340,693.420786,ZWE,716
1701,Zimbabwe,Africa,1997,46.809,11404948,792.449960,ZWE,716
1702,Zimbabwe,Africa,2002,39.989,11926563,672.038623,ZWE,716
1703,Zimbabwe,Africa,2007,43.487,12311143,469.709298,ZWE,716

In [21]:
df.nlargest(5,'lifeExp')

,COUNTRY,continent,year,lifeExp,pop,GDP,iso_alpha,iso_num
803,Japan,Asia,2007,82.603,127467972,31656.06806,JPN,392
671,"Hong Kong, China",Asia,2007,82.208,6980412,39724.97867,HKG,344
802,Japan,Asia,2002,82.000,127065841,28604.59190,JPN,392
695,Iceland,Europe,2007,81.757,301931,36180.78919,ISL,352
1487,Switzerland,Europe,2007,81.701,7554661,37506.41907,CHE,756

In [22]:
df.nlargest(5,'pop')

,COUNTRY,continent,year,lifeExp,pop,GDP,iso_alpha,iso_num
299,China,Asia,2007,72.961,1318683096,4959.114854,CHN,156
298,China,Asia,2002,72.028,1280400000,3119.280896,CHN,156
297,China,Asia,1997,70.426,1230075000,2289.234136,CHN,156
296,China,Asia,1992,68.690,1164970000,1655.784158,CHN,156
707,India,Asia,2007,64.698,1110396331,2452.210407,IND,356

In [23]:
df.nsmallest(10,'pop')

,COUNTRY,continent,year,lifeExp,pop,GDP,iso_alpha,iso_num
1296,Sao Tome and Principe,Africa,1952,46.471,60011,879.583586,STP,678
1297,Sao Tome and Principe,Africa,1957,48.945,61325,860.736903,STP,678
420,Djibouti,Africa,1952,34.812,63149,2669.529475,DJI,262
1298,Sao Tome and Principe,Africa,1962,51.893,65345,1071.551119,STP,678
1299,Sao Tome and Principe,Africa,1967,54.425,70787,1384.840593,STP,678
421,Djibouti,Africa,1957,37.328,71851,2864.969076,DJI,262
1300,Sao Tome and Principe,Africa,1972,56.480,76595,1532.985254,STP,678
1301,Sao Tome and Principe,Africa,1977,58.550,86796,1737.561657,STP,678
422,Djibouti,Africa,1962,39.693,89898,3020.989263,DJI,262
1302,Sao Tome and Principe,Africa,1982,60.351,98593,1890.218117,STP,678

## sort methods

In [26]:
dfs=pd.read_csv(r'E:\New folder\movies.csv')
dfs

,Series_Title,Released_Year,Runtime,Genre,IMDB_Rating,Director,Star1,No_of_Votes,Gross,Metascore
0,Chinatown,1974,130,Drama,8.1,Roman Polanski,Jack Nicholson,294230,29000000.0,92.0
1,The Girl with the Dragon Tattoo,2011,158,Crime,7.8,David Fincher,Daniel Craig,423010,102515793.0,71.0
2,Nueve reinas,2000,114,Crime,7.9,Fabián Bielinsky,Ricardo Darín,49721,1221261.0,80.0
3,Close Encounters of the Third Kind,1977,138,Drama,7.6,Steven Spielberg,Richard Dreyfuss,184966,132088635.0,90.0
4,Joker,2019,122,Crime,8.5,Todd Phillips,Joaquin Phoenix,939252,335451311.0,59.0
...,...,...,...,...,...,...,...,...,...,...
295,Kumonosu-jô,1957,110,Drama,8.1,Akira Kurosawa,Toshirô Mifune,46678,612604239.0,NaN
296,Falling Down,1993,113,Action,7.6,Joel Schumacher,Michael Douglas,171640,40903593.0,56.0
297,The Royal Tenenbaums,2001,110,Comedy,7.6,Wes Anderson,Gene Hackman,266842,52364010.0,76.0
298,Midnight Cowboy,1969,113,Drama,7.8,John Schlesinger,Dustin Hoffman,101124,44785053.0,79.0
299,Kai po che!,2013,130,Drama,7.7,Abhishek Kapoor,Amit Sadh,32628,1122527.0,40.0

In [27]:
dfs.sort_values('Series_Title')

,Series_Title,Released_Year,Runtime,Genre,IMDB_Rating,Director,Star1,No_of_Votes,Gross,Metascore
111,28 Days Later...,2002,113,Drama,7.6,Danny Boyle,Cillian Murphy,376853,45064915.0,73.0
265,8½,1963,138,Drama,8.0,Federico Fellini,Marcello Mastroianni,108844,50690.0,91.0
101,A Beautiful Mind,2001,135,Biography,8.2,Ron Howard,Russell Crowe,848920,170742341.0,72.0
235,A Bronx Tale,1993,121,Crime,7.8,Robert De Niro,Robert De Niro,128171,17266971.0,80.0
62,A Clockwork Orange,1971,136,Crime,8.3,Stanley Kubrick,Malcolm McDowell,757904,6207725.0,77.0
...,...,...,...,...,...,...,...,...,...,...
171,Who's Afraid of Virginia Woolf?,1966,131,Drama,8.0,Mike Nichols,Elizabeth Taylor,68926,839059631.0,75.0
242,Wonder,2017,113,Drama,8.0,Stephen Chbosky,Jacob Tremblay,141923,132422809.0,66.0
137,X-Men: Days of Future Past,2014,132,Action,7.9,Bryan Singer,Patrick Stewart,659763,233921534.0,75.0
155,Zerkalo,1975,107,Biography,8.1,Andrei Tarkovsky,Margarita Terekhova,40081,177345.0,NaN
114,Zindagi Na Milegi Dobara,2011,155,Comedy,8.1,Zoya Akhtar,Hrithik Roshan,67927,3108485.0,NaN

In [33]:
dfs.sort_values(['Genre','IMDB_Rating'],ascending=[True,False])

,Series_Title,Released_Year,Runtime,Genre,IMDB_Rating,Director,Star1,No_of_Votes,Gross,Metascore
129,The Dark Knight,2008,152,Action,9.0,Christopher Nolan,Christian Bale,2303232,534858444.0,84.0
77,The Matrix,1999,136,Action,8.7,Lana Wachowski,Lilly Wachowski,1676426,171479930.0,73.0
180,Shichinin no samurai,1954,207,Action,8.6,Akira Kurosawa,Toshirô Mifune,315744,269061.0,98.0
104,Terminator 2: Judgment Day,1991,137,Action,8.5,James Cameron,Arnold Schwarzenegger,995506,204843350.0,75.0
190,The Dark Knight Rises,2012,164,Action,8.4,Christopher Nolan,Christian Bale,1516346,448139099.0,78.0
...,...,...,...,...,...,...,...,...,...,...
29,The Third Man,1949,104,Film-Noir,8.1,Carol Reed,Orson Welles,158731,449191.0,97.0
75,The Innocents,1961,100,Horror,7.8,Jack Clayton,Deborah Kerr,27007,2616000.0,88.0
156,Saw,2004,103,Horror,7.6,James Wan,Cary Elwes,379020,56000369.0,46.0
94,Dark City,1998,100,Mystery,7.6,Alex Proyas,Rufus Sewell,187927,14378331.0,66.0
195,Once Upon a Time in the West,1968,165,Western,8.5,Sergio Leone,Henry Fonda,302844,5321508.0,80.0

In [32]:
pd.reset_option('display.max_rows',None)

In [35]:
dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Series_Title   300 non-null    object
 1   Released_Year  300 non-null    int64
 2   Runtime        300 non-null    int64
 3   Genre          300 non-null    object
 4   IMDB_Rating    300 non-null    float64
 5   Director       300 non-null    object
 6   Star1          300 non-null    object
 7   No_of_Votes    300 non-null    int64
 8   Gross          300 non-null    float64
 9   Metascore      264 non-null    float64
dtypes: float64(3), int64(3), object(4)
memory usage: 23.6+ KB

In [37]:
dfs['Series_Title'].str.swapcase()

0                               cHINATOWN
1         tHE gIRL WITH THE dRAGON tATTOO
2                            nUEVE REINAS
3      cLOSE eNCOUNTERS OF THE tHIRD kIND
4                                   jOKER
                      ...
295                           kUMONOSU-JÔ
296                          fALLING dOWN
297                  tHE rOYAL tENENBAUMS
298                       mIDNIGHT cOWBOY
299                           kAI PO CHE!
Name: Series_Title, Length: 300, dtype: object

In [38]:
dfs['Series_Title']=dfs['Series_Title'].str.lower()
dfs

,Series_Title,Released_Year,Runtime,Genre,IMDB_Rating,Director,Star1,No_of_Votes,Gross,Metascore
0,chinatown,1974,130,Drama,8.1,Roman Polanski,Jack Nicholson,294230,29000000.0,92.0
1,the girl with the dragon tattoo,2011,158,Crime,7.8,David Fincher,Daniel Craig,423010,102515793.0,71.0
2,nueve reinas,2000,114,Crime,7.9,Fabián Bielinsky,Ricardo Darín,49721,1221261.0,80.0
3,close encounters of the third kind,1977,138,Drama,7.6,Steven Spielberg,Richard Dreyfuss,184966,132088635.0,90.0
4,joker,2019,122,Crime,8.5,Todd Phillips,Joaquin Phoenix,939252,335451311.0,59.0
...,...,...,...,...,...,...,...,...,...,...
295,kumonosu-jô,1957,110,Drama,8.1,Akira Kurosawa,Toshirô Mifune,46678,612604239.0,NaN
296,falling down,1993,113,Action,7.6,Joel Schumacher,Michael Douglas,171640,40903593.0,56.0
297,the royal tenenbaums,2001,110,Comedy,7.6,Wes Anderson,Gene Hackman,266842,52364010.0,76.0
298,midnight cowboy,1969,113,Drama,7.8,John Schlesinger,Dustin Hoffman,101124,44785053.0,79.0
299,kai po che!,2013,130,Drama,7.7,Abhishek Kapoor,Amit Sadh,32628,1122527.0,40.0

In [45]:
dfs['Series_Title']=dfs['Series_Title'].str.upper()
dfs['swapcase']=dfs['Series_Title'].str.lower()

In [44]:
dfs

,Series_Title,Released_Year,Runtime,Genre,IMDB_Rating,Director,Star1,No_of_Votes,Gross,Metascore,swapcase
0,CHINATOWN,1974,130,Drama,8.1,Roman Polanski,Jack Nicholson,294230,29000000.0,92.0,chinatown
1,THE GIRL WITH THE DRAGON TATTOO,2011,158,Crime,7.8,David Fincher,Daniel Craig,423010,102515793.0,71.0,the girl with the dragon tattoo
2,NUEVE REINAS,2000,114,Crime,7.9,Fabián Bielinsky,Ricardo Darín,49721,1221261.0,80.0,nueve reinas
3,CLOSE ENCOUNTERS OF THE THIRD KIND,1977,138,Drama,7.6,Steven Spielberg,Richard Dreyfuss,184966,132088635.0,90.0,close encounters of the third kind
4,JOKER,2019,122,Crime,8.5,Todd Phillips,Joaquin Phoenix,939252,335451311.0,59.0,joker
...,...,...,...,...,...,...,...,...,...,...,...
295,KUMONOSU-JÔ,1957,110,Drama,8.1,Akira Kurosawa,Toshirô Mifune,46678,612604239.0,NaN,kumonosu-jô
296,FALLING DOWN,1993,113,Action,7.6,Joel Schumacher,Michael Douglas,171640,40903593.0,56.0,falling down
297,THE ROYAL TENENBAUMS,2001,110,Comedy,7.6,Wes Anderson,Gene Hackman,266842,52364010.0,76.0,the royal tenenbaums
298,MIDNIGHT COWBOY,1969,113,Drama,7.8,John Schlesinger,Dustin Hoffman,101124,44785053.0,79.0,midnight cowboy
299,KAI PO CHE!,2013,130,Drama,7.7,Abhishek Kapoor,Amit Sadh,32628,1122527.0,40.0,kai po che!